Enums/СостоянияПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияПриложений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовитсяКИспользованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Используется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Конвертируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Копируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КУдалению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПодготовки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортИзФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МиграцияПриложения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СостоянияПриложений/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значение перечисления по имени значения.
//
// Параметры:
//  ИмяЗначения	- Строка - имя значения, как оно передается через API
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СостоянияПриложений - значение перечисления по имени.
//
Функция ЗначениеПоИмени(ИмяЗначения) Экспорт
	
	Если ИмяЗначения = "ready" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Готово");
	ИначеЕсли ИмяЗначения = "preparation" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.ГотовитсяКИспользованию");
	ИначеЕсли ИмяЗначения = "used" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Используется");
	ИначеЕсли ИмяЗначения = "converted" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Конвертируется");
	ИначеЕсли ИмяЗначения = "copied" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Копируется");
	ИначеЕсли ИмяЗначения = "decommissioned" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.КУдалению");
	ИначеЕсли ИмяЗначения = "new" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Новая");
	ИначеЕсли ИмяЗначения = "error" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.ОшибкаПодготовки");
	ИначеЕсли ИмяЗначения = "removed" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Удалена");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

// Возвращает имя значения для API по значению перечисления.
//
// Параметры:
//  Значение - ПеречислениеСсылка.СостоянияПриложений - значение перечисления.
// 
// Возвращаемое значение:
//  Строка - имя значения для API.
//
Функция ИмяПоЗначению(Значение) Экспорт
	
	Если Значение = ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Готово") Тогда
		Возврат "ready";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.СостоянияПриложений.ГотовитсяКИспользованию") Тогда
		Возврат "preparation";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Используется") Тогда
		Возврат "used";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Конвертируется") Тогда
		Возврат "converted";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Копируется") Тогда
		Возврат "copied";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.СостоянияПриложений.КУдалению") Тогда
		Возврат "decommissioned";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Новая") Тогда
		Возврат "new";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.СостоянияПриложений.ОшибкаПодготовки") Тогда
		Возврат "error";
	ИначеЕсли Значение = ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Удалена") Тогда
		Возврат "removed";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
